{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "WanxiangI2VHumanOmniArch",
    "parent_library": "hfm.archs.wanxiang_i2v.wanxiang_i2v_human_omni_arch"
  },
  "base_model_name_or_path": null,
  "bias": "none",
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": "gaussian",
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 128,
  "lora_bias": false,
  "lora_dropout": 0.0,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 128,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "ffn.0",
    "k",
    "q",
    "v",
    "ffn.2",
    "v_img",
    "o",
    "k_img"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}